In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"C:\Users\shani\Desktop\ACADEMY\Notebooks\pdfs\gapminder-unfiltered.tsv",sep="\t")
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [3]:
df.shape

(3313, 6)

In [4]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [5]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [6]:
country=df['country']

In [7]:
country.head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

In [8]:
country.tail()

3308    Zimbabwe
3309    Zimbabwe
3310    Zimbabwe
3311    Zimbabwe
3312    Zimbabwe
Name: country, dtype: object

In [9]:
subset=df[['country','continent','year']]
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [10]:
subset.tail()

       country continent  year
3308  Zimbabwe    Africa  1987
3309  Zimbabwe    Africa  1992
3310  Zimbabwe    Africa  1997
3311  Zimbabwe    Africa  2002
3312  Zimbabwe    Africa  2007